/* eslint-disable max-len */

import Post from 'src/models/Post';

const posts: Post[] = [
  new Post(
    '1',
    1,
    'Официальный курс евро превысил 83 рубля, доллар — дороже 77 рублей',
    'Банк России установил курс евро на 23 апреля на уровне 83,68 рублей. По сравнению с предыдущим днем официальный курс единой европейской валюты вырос более чем на 1 рубль.\n\nДоллар по курсу ЦБ на 23 апреля — 77,04 рубля (+79 копеек).\n\nНа торгах на Московской бирже евро, по состоянию на 13:53 мск, стоил 83,11 рубля, на 61 копейку меньше уровня закрытия предыдущей сессии. Доллар торговался по 76,48 рубля (-59 копеек).',
    'https://image.shutterstock.com/image-photo/view-blue-lake-shore-overgrown-260nw-133426277.jpg',
    new Date(),
    10,
    2
  ),
  new Post(
    '2',
    2,
    '«Спутник»: космический триллер, в котором инопланетный паразит живет внутри советского космонавта',
    '23 апреля космический хоррор Егора Абраменко «Спутник» одновременно выходит в онлайн-сервисах more.tv, Wink и ivi (апрельская премьера в кинотеатрах отменилась из-за введения карантина — и фильм сразу появится в онлайне). Действие фильма развивается в СССР в 1983 году — советский космонавт Константин Вешняков (Петр Федоров) возвращается из миссии с пришельцем, который поселился внутри него. Героя СССР в тайной лаборатории исследуют спецслужбы (в лице героя Федора Бондарчука) и ученые (нейрофизиолога Татьяну Климову играет Оксана Акиньшина). Кинокритик «Медузы» Антон Долин рассказывает, почему с первого взгляда похожая на «Чужого» история на самом деле — не о космосе, а об СССР и советских гражданах.',
    'https://image.shutterstock.com/image-photo/view-blue-lake-shore-overgrown-260nw-133426277.jpg',
    new Date(),
    33,
    1
  ),
  new Post(
    '3',
    1,
    'Вокруг шум: как в России празднуют 150 лет со дня рождения Ленина',
    'Телеканал под руководством Маргариты Симоньян снял несколько роликов о том, как Ленин отмечал бы свой день рождения в современной России. В одном из них он в одиночку тащит бревна — из-за коронавируса все сидят по домам и революционеру некому помочь. Ленин грустно вздыхает и дует в дудку-язычок. В конце видео появляется надпись: «Все работы, кроме жизненно важных, остановлены. Отложим благоустройство на потом. Будем живее всех живых».',
    'https://image.shutterstock.com/image-photo/view-blue-lake-shore-overgrown-260nw-133426277.jpg',
    new Date(),
    565,
    23
  ),
  new Post(
    '4',
    1,
    'Вокруг шум: как в России празднуют 150 лет со дня рождения Ленина',
    'Телеканал под руководством Маргариты Симоньян снял несколько роликов о том, как Ленин отмечал бы свой день рождения в современной России. В одном из них он в одиночку тащит бревна — из-за коронавируса все сидят по домам и революционеру некому помочь. Ленин грустно вздыхает и дует в дудку-язычок. В конце видео появляется надпись: «Все работы, кроме жизненно важных, остановлены. Отложим благоустройство на потом. Будем живее всех живых».',
    'https://image.shutterstock.com/image-photo/view-blue-lake-shore-overgrown-260nw-133426277.jpg',
    new Date(),
    565,
    23
  ),
  new Post(
    '5',
    1,
    'Вокруг шум: как в России празднуют 150 лет со дня рождения Ленина',
    'Телеканал под руководством Маргариты Симоньян снял несколько роликов о том, как Ленин отмечал бы свой день рождения в современной России. В одном из них он в одиночку тащит бревна — из-за коронавируса все сидят по домам и революционеру некому помочь. Ленин грустно вздыхает и дует в дудку-язычок. В конце видео появляется надпись: «Все работы, кроме жизненно важных, остановлены. Отложим благоустройство на потом. Будем живее всех живых».',
    'https://image.shutterstock.com/image-photo/view-blue-lake-shore-overgrown-260nw-133426277.jpg',
    new Date(),
    565,
    23
  ),
  new Post(
    '6',
    1,
    'Вокруг шум: как в России празднуют 150 лет со дня рождения Ленина',
    'Телеканал под руководством Маргариты Симоньян снял несколько роликов о том, как Ленин отмечал бы свой день рождения в современной России. В одном из них он в одиночку тащит бревна — из-за коронавируса все сидят по домам и революционеру некому помочь. Ленин грустно вздыхает и дует в дудку-язычок. В конце видео появляется надпись: «Все работы, кроме жизненно важных, остановлены. Отложим благоустройство на потом. Будем живее всех живых».',
    'https://image.shutterstock.com/image-photo/view-blue-lake-shore-overgrown-260nw-133426277.jpg',
    new Date(),
    565,
    23
  ),
  new Post(
    '7',
    1,
    'Вокруг шум: как в России празднуют 150 лет со дня рождения Ленина',
    'Телеканал под руководством Маргариты Симоньян снял несколько роликов о том, как Ленин отмечал бы свой день рождения в современной России. В одном из них он в одиночку тащит бревна — из-за коронавируса все сидят по домам и революционеру некому помочь. Ленин грустно вздыхает и дует в дудку-язычок. В конце видео появляется надпись: «Все работы, кроме жизненно важных, остановлены. Отложим благоустройство на потом. Будем живее всех живых».',
    'https://image.shutterstock.com/image-photo/view-blue-lake-shore-overgrown-260nw-133426277.jpg',
    new Date(),
    565,
    23
  ),
];

export default posts;
